/** ЗАВДАННЯ 10 - Коментар перед функцією
 *
 * 1. Оголосіть функцію з двома параметрами, значення яких – числа
 *
 * 2. Ця функція повинна повертати різницю між першим та другим параметром
 *
 * 3. Додайте багаторядковий коментар перед функцією:
 * - Текст коментаря "Повертає різницю двох чисел"
 * - Вкажіть тип параметрів - number
 * - Вкажіть тип значення, що повертається - number
 * - Опишіть значення, що повертається - "Різниця чисел"
 *
 * 4. Викличте функцію
 */

/**
 * Повертає різницю двох чисел
 * @param {number} num1
 * @param {number} num2
 * @returns {number} /Різниця чисел
 */

function math(num1, num2) {
  return num1 - num2;
}

console.log(math(10, 5));

const result = math(30, 5);

console.log(result);
