/** ЗАВДАННЯ 55 - Деструктуризація результату функції
 *
 * 1. Створіть функцію "minMax", яка приймає будь-яку кількість аргументів
 *
 * 2. Ця функція повинна повертати масив із двох елементів:
 * - Перший елемент масиву – мінімальне значення серед усіх аргументів.
 * - Другий елемент масиву – це максимальне значення серед усіх аргументів.
 */

function minMax(...nums) {
  return [Math.min(...nums), Math.max(...nums)];
}

let min, max;
/* Викличте тут функцію "minMax" з аргументами 24, 5, 34, 10
і використовуючи деструктуризацію масивів надайте значення змінним "min" та "max" */
[min, max] = minMax(24, 5, 34, 10);
console.log(min, max); // 5, 34

/* Викличте тут функцію "minMax" ще раз з аргументами 18, 23, 103, 70, 80, 25 */
[min, max] = minMax(18, 23, 103, 70, 80, 25);
console.log(min, max); // 18, 103
