/** ЗАВДАННЯ 50 - Шаблонні рядки
 *
 * 1. Створіть функцію "templateLiteral" з одним параметром "num"
 *
 * 2. Функція повинна повертати багаторядковий рядок.
 *
 * 3. Нижче наведено приклади дзвінків функції.
 */

const templateLiteral = num => {
  return `Число ${num}.
Це число ${num < 10 ? 'менше' : 'більше чи рівно'} 10.
Квадратний корінь цього числа – ${Math.sqrt(num)}.`;
};

// ТЕСТ 1

const myNumber = 9;
console.log(templateLiteral(myNumber));

/* 
Число 9.
Це число менше ніж 10.
Квадратний корінь цього числа – 3.
*/

// ТЕСТ 2

const myAnotherNumber = 25;
console.log(templateLiteral(myAnotherNumber));

/* 
Число 25.
Це число більше чи дорівнює 10.
Квадратний корінь цього числа – 5.
*/
