/** ЗАВДАННЯ 73 - Шаблонні рядки
 *
 * Створіть функцію "carInfo", яка повертає інформацію про машину:
 * - Автомобіль вважається дешевим, якщо його ціна <= 20000
 * - Автомобіль вважається дорогим, якщо його ціна > 20000
 *
 * Висновки в консолі повинні збігатися з тими, які наприкінці завдання
 */

const cars = [
  { brand: 'Honda', price: 13000 },
  { brand: 'Rolls-Royce', price: 120000 },
];

// Створіть функцію "carInfo" тут

const carInfo = ({ brand, price }) => {
  return `Ціна автомобіля ${brand} - ${price} $ і це ${
    price > 20000 ? 'дорога' : 'дешева'
  } машина.`;
};

cars.forEach(car => console.log(carInfo(car)));
// Ціна автомобіля Honda - 13000 $ і це дешева машина
// Ціна автомобіля Rolls-Royce - 120000 $ і це дорога машина
