/** ЗАВДАННЯ 27 - Const
 *
 * Дайте відповідь на наступні питання:
 * 1. Чому після 13 рядка не видається помилка?
 * 2. Чому після рядка 18 генерується TypeError?
 *
 * Змініть один рядок коду, щоб ця помилка зникла.
 * Не змінюйте рядки 13, 18
 */

let arr = [1, 2]; // <-- Оголошення змінної використовуючи const

arr.push(3);

console.log(arr);
// [1, 2, 3]

arr = [1, 2, 3, 4];
// ДО: Uncaught TypeError: Assignment to constant variable.
// ПІСЛЯ: Немає помилки

console.log(arr);
// [1, 2, 3, 4]
